RIET/src/Documents/ПереносОстатковAU/ПереносОстатковAU.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереносОстатковAU</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.МестонахождениеОСБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеАрендованное</registerRecords>
  <registerRecords>AccumulationRegister.Оборудование</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСПокупателями</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеЛокальное</registerRecords>
  <registerRecords>AccumulationRegister.ОборудованиеЭкспорт</registerRecords>
  <registerRecords>AccumulationRegister.InventoryBatches</registerRecords>
  <attributes>
    <name>AUСтарый</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
</mdclass:Document>

RIET/src/InformationRegisters/МестонахождениеОСБухгалтерскийУчет/МестонахождениеОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МестонахождениеОСБухгалтерскийУчет</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>МОЛ</name>
    <comment>Выбирается из списка регистра сведений &quot;Работники организаций&quot;</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/AccumulationRegisters/ВзаиморасчетыСПокупателями/ВзаиморасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыСПокупателями</name>
  <resources>
    <name>СуммаВзаиморасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сделка</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
      <types>DocumentRef.ПередачаОС</types>
      <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
      <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
      <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ОтчетАгентаПоРасходам</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
      <types>DocumentRef.ОтчетПринципалуОПродажах</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетНаПредоплату</name>
    <type>
      <types>DocumentRef.СчетНаОплатуПокупателю</types>
      <types>DocumentRef.ОтражениеНачисленияНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КостЦентр</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнвойсинговыйЦентр</name>
    <type>
      <types>CatalogRef.ИнвойсинговыеЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>WO</name>
    <type>
      <types>CatalogRef.ЗаказНаряды</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/Оборудование/Оборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Оборудование</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Декларация</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИмпорт</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеАрендованное/ОборудованиеАрендованное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеАрендованное</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Декларация</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИмпорт</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеЛокальное/ОборудованиеЛокальное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеЛокальное</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НомерНакладной</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНакладной</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/ОборудованиеЭкспорт/ОборудованиеЭкспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборудованиеЭкспорт</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Декларация</name>
    <type>
      <types>DocumentRef.Декларации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураИмпорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерСтрокиГТД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НалоговыйПериод</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/AccumulationRegisters/InventoryBatches/InventoryBatches.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>InventoryBatches</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Fiscal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FiscalPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Good</name>
    <type>
      <types>CatalogRef.InventoryGoods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>InventoryLocation</name>
    <type>
      <types>CatalogRef.InventoryLocations</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Batch</name>
    <type>
      <types>DocumentRef.InventoryПоступление</types>
      <types>DocumentRef.InventoryКорректировка</types>
      <types>DocumentRef.InventoryПеремещение</types>
    </type>
  </dimensions>
  <dimensions>
    <name>FinishedGood</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Company</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>TaxRegistration</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/ПереносОстатковAU/ObjectModule.bsl
Процедура СформироватьЗаписиМестонахождениеОС() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.ОсновноеСредство,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Организация,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.МОЛ,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.Местонахождение,
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.КостЦентр
	|ИЗ
	|	РегистрСведений.МестонахождениеОСБухгалтерскийУчет.СрезПоследних(&Дата, ) КАК МестонахождениеОСБухгалтерскийУчетСрезПоследних
	|ГДЕ
	|	МестонахождениеОСБухгалтерскийУчетСрезПоследних.КостЦентр = &КостЦентр";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("КостЦентр", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяЗапись = Движения.МестонахождениеОСБухгалтерскийУчет.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Выборка);
		НоваяЗапись.Период = Дата;
		НоваяЗапись.КостЦентр = AU;
	КонецЦикла;		
	
КонецПроцедуры

Процедура СформироватьДвиженияВзаиморасчетыСПокупателями() Экспорт
	
	Набор = Движения.ВзаиморасчетыСПокупателями;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВзаиморасчетыСПокупателямиОстатки.ДоговорКонтрагента,
	|	ВзаиморасчетыСПокупателямиОстатки.ПодразделениеОрганизации,
	|	ВзаиморасчетыСПокупателямиОстатки.Сделка,
	|	ВзаиморасчетыСПокупателямиОстатки.СчетНаПредоплату,
	|	ВзаиморасчетыСПокупателямиОстатки.КостЦентр,
	|	ВзаиморасчетыСПокупателямиОстатки.ИнвойсинговыйЦентр,
	|	ВзаиморасчетыСПокупателямиОстатки.WO,
	|	ВзаиморасчетыСПокупателямиОстатки.СуммаВзаиморасчетовОстаток КАК СуммаВзаиморасчетов,
	|	ВзаиморасчетыСПокупателямиОстатки.СуммаУпрОстаток КАК СуммаУпр,
	|	ВзаиморасчетыСПокупателямиОстатки.СуммаРеглОстаток КАК СуммаРегл
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСПокупателями.Остатки(&Дата, КостЦентр = &КостЦентр) КАК ВзаиморасчетыСПокупателямиОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("КостЦентр", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДвижение.КостЦентр = AU;
	КонецЦикла;	
	
КонецПроцедуры

Процедура СформироватьДвиженияОборудование() Экспорт
	
	Набор = Движения.Оборудование;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОборудованиеОстатки.Декларация,
	|	ОборудованиеОстатки.Номенклатура,
	|	ОборудованиеОстатки.AU,
	|	ОборудованиеОстатки.НомерСтрокиГТД,
	|	ОборудованиеОстатки.НалоговыйПериод,
	|	ОборудованиеОстатки.СуммаОстаток КАК Сумма,
	|	ОборудованиеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Оборудование.Остатки(&Дата, AU = &КостЦентр) КАК ОборудованиеОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("КостЦентр", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДвижение.AU = AU;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияОборудованиеАрендованное() Экспорт
	
	Набор = Движения.ОборудованиеАрендованное;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОборудованиеАрендованноеОстатки.Декларация,
	|	ОборудованиеАрендованноеОстатки.Номенклатура,
	|	ОборудованиеАрендованноеОстатки.AU,
	|	ОборудованиеАрендованноеОстатки.НомерСтрокиГТД,
	|	ОборудованиеАрендованноеОстатки.Контрагент,
	|	ОборудованиеАрендованноеОстатки.НалоговыйПериод,
	|	ОборудованиеАрендованноеОстатки.СуммаОстаток КАК Сумма,
	|	ОборудованиеАрендованноеОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОборудованиеАрендованное.Остатки(&Дата, AU = &AU) КАК ОборудованиеАрендованноеОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("AU", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДвижение.AU = AU;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияОборудованиеЛокальное() Экспорт
	
	Набор = Движения.ОборудованиеЛокальное;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОборудованиеЛокальноеОстатки.НомерНакладной,
	|	ОборудованиеЛокальноеОстатки.Поставщик,
	|	ОборудованиеЛокальноеОстатки.AU,
	|	ОборудованиеЛокальноеОстатки.РО,
	|	ОборудованиеЛокальноеОстатки.ДатаНакладной,
	|	ОборудованиеЛокальноеОстатки.Подразделение,
	|	ОборудованиеЛокальноеОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОборудованиеЛокальное.Остатки(&Дата, AU = &AU) КАК ОборудованиеЛокальноеОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("AU", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДВижение.AU = AU;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияОборудованиеЭкспорт() Экспорт
	
	Набор = Движения.ОборудованиеЭкспорт;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОборудованиеЭкспортОстатки.Декларация,
	|	ОборудованиеЭкспортОстатки.Номенклатура,
	|	ОборудованиеЭкспортОстатки.AU,
	|	ОборудованиеЭкспортОстатки.НомерСтрокиГТД,
	|	ОборудованиеЭкспортОстатки.НалоговыйПериод,
	|	ОборудованиеЭкспортОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.ОборудованиеЭкспорт.Остатки(&Дата, AU = &AU) КАК ОборудованиеЭкспортОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("AU", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДВижение.AU = AU;
	КонецЦикла;
	
КонецПроцедуры

Процедура СформироватьДвиженияInventoryBatches() Экспорт
	
	Набор = Движения.InventoryBatches;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	InventoryBatchesОстатки.Good,
	|	InventoryBatchesОстатки.InventoryLocation,
	|	InventoryBatchesОстатки.AU,
	|	InventoryBatchesОстатки.Batch,
	|	InventoryBatchesОстатки.FinishedGood,
	|	InventoryBatchesОстатки.Company,
	|	InventoryBatchesОстатки.TaxRegistration,
	|	InventoryBatchesОстатки.QuantityОстаток КАК Quantity,
	|	InventoryBatchesОстатки.SumОстаток КАК Sum
	|ИЗ
	|	РегистрНакопления.InventoryBatches.Остатки(&Дата, AU = &AU) КАК InventoryBatchesОстатки";
	Запрос.УстановитьПараметр("Дата", МоментВремени());
	Запрос.УстановитьПараметр("AU", AUСтарый);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		текДвижение = Набор.ДобавитьРасход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
			
		текДвижение = Набор.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(текДвижение, Выборка);
		текДвижение.Период = Дата;
		текДВижение.AU = AU;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Ссылка <> Неопределено И Дата <> Ссылка.Дата Тогда
		Для Каждого Движение Из Движения Цикл
			Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
				// Набор никто не трогал
				Движение.Прочитать();
			КонецЕсли;
			ТаблицаДвижений = Движение.Выгрузить();
			ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
			Движение.Загрузить(ТаблицаДвижений);
			Движение.Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
	Если Ссылка <> Неопределено И Ссылка.ПометкаУдаления <> ПометкаУдаления Тогда
		УстановитьАктивностьДвижений(НЕ ПометкаУдаления);
	ИначеЕсли ПометкаУдаления Тогда
		//запись помеченного на удаление документа с активными записями
		УстановитьАктивностьДвижений(Ложь);
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает/снимает признак активности движений документа
//
Процедура УстановитьАктивностьДвижений(ФлагАктивности)
	
	Для Каждого Движение Из Движения Цикл   
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		Для Каждого Строка Из Движение Цикл
			Если Строка.Активность = ФлагАктивности Тогда
				Продолжить;
			КонецЕсли;
			Строка.Активность = ФлагАктивности;
			Движение.Записывать = Истина;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры // УстановитьАктивностьДвижений()
